# リストの基本
# 変数fruitsに、複数の文字列を要素に持つリストを代入してください
fruits = ['apple', 'banana', 'orange']

# インデックス番号が0の要素を出力してください
print(fruits[0])

# インデックス番号が2の要素を文字列と連結して出力してください
print('好きな果物は' + fruits[2] + 'です')

#==================================================================
# リストの追加と変更
fruits = ['apple', 'banana', 'orange']

# リストの末尾に文字列「grape」を追加してください
fruits.append('grape')

# 変数fruitsに代入したリストを出力してください
print(fruits)

# インデックス番号が0の要素を文字列「cherry」に更新してください
fruits[0] = 'cherry'

# インデックス番号が0の要素を出力してください
print(fruits[0])

#==================================================================
# for 変数名 if リスト:　（変数名は単数で）
fruits = ['apple', 'banana', 'orange']

# for文を用いてリストの要素を1つずつ取り出し、「好きな果物は◯◯です」と出力してください
for fruit in fruits:
    print('好きな果物は' + fruit + 'です')
