# 「Hello World」と出力してください
print("Hello World")
print('Hello World')

# 数値の7を出力してください
print(7)

# 9に3足した値を出力してください
print(9 + 3)

# 「9 + 3」を文字列として出力してください
print('9 + 3')

# 9を2で割った値を出力してください
print(9 / 2)

# 7に5を掛けた値を出力してください
print(7 * 5)

# 5を2で割った時の余りを出力してください
print(5 % 2)

#=====================================================================
# 文字列の連結
# my_nameという変数に「にんじゃわんこ」という文字列を代入してください
my_name = 'にんじゃわんこ'

# my_nameを用いて、「私はにんじゃわんこです」となるように変数と文字列を連結して出力してください
print('私は' + my_name + 'です')

#=====================================================================
# データ型について str/int
age = 24
# ageを用いて「私は24歳です」と出力してください
print('私は' + str(age) + '歳です')

count = '5'
# countに1を足した値を出力してください
print(1 + int(count))
